<div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>I would be more happy if you doesn’t even complete your schooling’s</b>. My society is designed to marry the person of same qualification. So poor will be poor, rich will be rich, educated will be educated and uneducated will be uneducated. I don’t want that to happen. That doesn’t mean that I won’t marry the educated girl.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;<b>&nbsp;I would be happy if you wanna be a home minister</b>. My society is created in such a way that both persons should earn to run a family. According to me that is wrong. People are living without three times food in a day, people are living simply sitting eating and sleeping, people are there simply earning and not spending the earnings. According to me human mind always climb on the ladder when it comes to money. I don’t want that to happen in my life. I want to run my life with whatever I have.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>I would be happy if you take your decisions on your own.</b> Like, going to job, going to higher studies, visiting his mom,dad and siblings whenever she wants, roaming with friends, going to theatre with her friends, helping her siblings. For those kinnda things you don’t need to ask permission, but I would be happy if you inform me about your decisions.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>I would be happy if you know some kinnda jobs of your wish</b> like tailoring, gardening. We don’t know when we’ll die. I don’t want you&amp;children to be depend on others after my death. That doesn’t mean that you need to do job when I alive, that is always your choice.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>I clean my plates after eat</b>, I wash my dresses even if I earn and you don’t. I would like to share works with you while cooking and cleaning house.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>I am a vegetation</b>. I don’t have a problem If you cook non-veg food until you force me to eat.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>There should be some understanding when it comes to money spending</b>. I don’t know how to express. I don’t want you to inform me for all your expenses.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;I<b> don’t want you to eat food which was remained from last time</b> and cook new one for me. I wanna share everything with you regardless of old or new.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;<b>I would be happy to accept divorce if you can’t continue life with me</b> anymore and want divorce before having child. Also I would want you to not to think about divorce after having child. Divorce will affects children’s too. I don’t like my children’s to see their parent divorce.</div><div><br></div><div>&nbsp;&nbsp;&nbsp;&nbsp;I’ll do the same to you that how I want you to be. Also I<b> will ask your dreams about your life partner and try to full fill those</b> if I can. I’ll try to understand you, adjust with you, support you till my end of life.</div><div><br></div><div style="text-align: center; "><a href="https://meetilaiya.wordpress.com/2016/05/31/how-i-treat-my-life-partner/" target="_blank">Reference Link</a></div>
