The simplest way is to rebase the currency.
<ul>
<li>Introduce a new currency - New Indian Rupee - that is equal to 100 rupees. 1 NIR = 100 INR.</li>
<li>Ask RBI to print a lot of new currency and the RBI would in turn ask the banks to load up the ATMs with the new currency.</li>
<li>Declare the existing currency [INR] as invalid for transaction and for a limited period the banks will take in the existing rupee notes for the new Indian rupee. As an added bonus it will bring a lot of black money out.</li>
<li>Make the banks and all financial institutions convert existing debts to the new currency. Since everything is computerized it can happen with the push of a button. Thus, your 10 lakhs in INR savings will become 10000 NIR and your monthly EMI of 20000 INR will become 200 NIR. Same for your salaries etc.</li>
<li>Since 1 NIR = 100 INR, by simple mathematics, 1 NIR will approximately equal 1 GBP and about 1.5 USD.</li>
<li><li>After a couple of years, completely remove the existing INR from the system and rename the NIR to INR.</li>
<ul>
It changes nothing in the economy and will invite some derision from global economists, but can give satisfaction to some of the uber nationalists that their currency is “higher than” the mighty dollar.


People assume the absolute value of a currency is somehow correlated with the strength of an economy. If that were the case, Japan must be significantly poorer than India and Kuwait must be way richer than Switzerland. As I mentioned above, any country can rebase their currency without changing anything in the economy.


If currency value doesn’t matter, what matters? The only thing that matters to an economy in the long term is the productivity of the people - if an average Indian can produce more value of goods than an average non-Indian, the average Indian will be richer and Indian economy will be the richest. Thus, the only thing that matters is how we can get an average Indian to produce more and get better value.


<h2>Lets have a different view</h2>,

Everyone wants to see this $1 = 1re. But that will make our country into a very bad state. Very pathetic state to be very precise. It will make many people to loose their job. It will make something very nasty. I don't think India can take that at this point of time. You want to know why?? Well I will try to explain. Any economists or some one have who have knowledge can feel free to correct me if I'm wrong.

Before getting into it lets agree certain things,

Why do you think lot of Americans, American companies outsource their job to India. Primary reason is it is dead cheap.

Why do you think Indians try hard and harder to reach US. So that they can save some money and clear all the debts in India and return with loads of money.

Why do you think call centres or being outsourced to India ? Is it because we have a perfect English. No because we are dead cheap. $1 = 70 Rs.

Why do you think Indians are able to built some extraordinary houses and flats?? Is it because they are born rich. No they work in US and get paid in dollars which they use to pay the debts here. Simple. Their parents can have a good life here.

I have just mentioned few lay man points which could be related by everyone. So being said that, most of our jobs (IT, Call centre) are dependant on US.

Let us assume a company like HCL or TCS charges $100 per hour (just for eg) for a senior employee. If we convert that to INR it becomes 7500 Rs with which company can almost pay half of the salary for a fresher.

So if $1 becomes 1 re. Either we have to quote more to the US companies or we have to reduce the salary of all the employees.

Scenario 1: Indian companies asking for $7500 to an American company for a senior employee. No arguments needed. We will move to next scenario.

Scenario 2: Indian companies accepting $100 per hour which will give them 100Rs. So obviously lay off and reduction of salary will be implemented with full aggression.

same goes for IT, Call centre And people will stop trying to go US as well. May be fee will try to have a better life style.

What happens to our nation because of this??

We all know that buying a own house is a dream for every middle class parent. So upon getting into IT with a decent salary 90% of us will buy a flat and pay EMI (Mostly 30% of our salary).

So if people are sent out or if the salary is reduced people who got loan from banks might not able to pay EMI and as a result, bank will be in a situation to take over their houses. Banks will try to sell the houses but will not find out any one.

Unemployment. Loads and loads of unemployment. Imagine more than 60% of IT people are sent out in the name of lay off? Inflow of projects from US will slowly reduce and will reach NIL very fast. All the call centres might probably be shut down.

People who reside in US will come down to their own country as the money value is same. No point in staying with his family being settled in India. This will increase the unemployment and seizing of houses by bank will also be the same.

So if $1 becomes 1 re we will face a extreme crisis for next few years. We have to start from the beginning. We have to introduce lot of new products to the world which will increase the export from our country. People have to concentrate on agriculture for same reason.

But with the kind of poverty we will be in, it's not possible to do that. This will eventually destroy India.

We are dependant on US as of now for the jobs and our banks are dependant on us for repaying the loan. This is a paradox. We all are dependant on others, others, and others and will end up in US.

I would be happy to see $1 = 1 re. But not at this point. We have to slowly reduce the dependancy from US and build our nation with our own money. This will not be possible if we all decide to move to US. We have to stay here. We have to innovate things. For the kind of population we have, we should have more than 20 silicon valleys in India. Educated people should concentrate on Agriculture which will reduce our dependancy in the huge level.


<a href='https://www.quora.com/How-would-you-make-INR-1-into-1'>Source</a>
